# RenderingSettings Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RenderingSettings Properties
RenderingSettings Class See Also
---
The RenderingSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BackgroundStyle | The enum value that controls the background style for rendering. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LightingSource | The lighting scheme type. |
| PrinterResolution | The resolution level when using printer. |
| ResolutionTarget | The resolution target. |
| ResolutionValue | The rendering resolution in dots per inch (DPI). |
| UsesRegionRendering | The bool value that indicates whether to use region rendering. |

# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace